leetcode_42_trapping_rain_water.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 42. Trapping Rain Water</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 42. Trapping Rain Water</h1>
<p>
<a href="how_can_we_extend_the_solution_for_i_to_i_1.html#ID-45B9F3C8-D007-4980-95EF-4361906245A8">How can we extend the solution for \(i\) to \(i+1\)?</a>  There is nothing to do if we have just one or two walls.  With three walls \(h_1, h_2\) and \(h_3\), there is no water trapped if \(h_1<h_2<h_3\) or \(h_1>h_2>h_3\), but there is water trapped if \(h_1>h_2\) and \(h_3>h_2\).  In the last case, we can compute the amount of water trapped \((\min(h_3,h_1) - h_2) \times (i_3 - i_1 - 1)\).  After that, we can remove \(a_2\), add \(a_3\) and continue the process with the next height.  We can use <a href="monotonic_stack.html#ID-E4CFDB04-DCFD-47E3-9ED2-0DC6446420B5">Monotonic Stack</a> to keep track of the heights and solve the problem in time and space \(O(n)\).
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">trap</span>(<span style="font-weight: bold;">self</span>, height: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold;">int</span>:
        ans = 0
        <span style="font-weight: bold; font-style: italic;">st</span> = []
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(<span style="font-weight: bold;">len</span>(height)):
            <span style="font-weight: bold;">while</span> st <span style="font-weight: bold;">and</span> height[st[-1]] &lt;= <span style="font-weight: bold; font-style: italic;">height</span>[i]:
                c = st.pop()
                <span style="font-weight: bold;">if</span> <span style="font-weight: bold; font-style: italic;">st</span>:
                    h = <span style="font-weight: bold;">min</span>(height[i], height[st[-1]]) - height[c]
                    <span style="font-weight: bold; font-style: italic;">w</span> = i - st[-1] - 1
                    <span style="font-weight: bold; font-style: italic;">ans</span> += h * w
            st.append(i)
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().trap([0, 1, 0, 2, 1, 0, 1, 3, 2, 1, 2, 1]) == 6
<span style="font-weight: bold;">assert</span> Solution().trap([4, 2, 0, 3, 2, 5]) == 9
</pre>
</div>
</div>
</body>
</html>